// Import stylesheets
import './style.css';

// Write Javascript code!

// Задание 1
// Создайте переменную num, присвойте ей любое число, затем сравните его с числом 5, (больше, меньше или равно), результаты выведите в консоль

// Задание 2
//  Создать переменную firstName и присвоить ей ваше имя, создать переменную lastName и присвоить ей вашу Фамилию, создать переменную age и присвоить ваш возраст, затем при помощи конкатинации строк, вывести значения переменных, разделенных через пробел в консоль
// Пример: Дамир Хаваза 26

// Задание 3
// Вывести  окно с сообщением "Модальное окно открыто, нажмите ок"

// Задание 4
// Вывести окно с вопросом - "Как тебя зовут?" где можно будет ввести имя, затем имя нужно сохранить в переменную и вывести ее в консоль

// Задание 5
// Вывести окно с текстом "Введите число", затем сравните его с числом 5, и результат выведите в консоль, если введенное число равно 5, то в консоли у вас должно быть true, если нет, то false

// Задание 6
// Вывести в confirm окно вопрос - "Вам есть 18?", и результат вывести в alert.
// Если нажал ОК - то вывод true, если  нажал Отмена, то false

// Задание 7
// Вывести в консоль тип числа 5, строки "Codify", null, undefined, true, false
//  При помощи оператора typeof

// Задание 8
// Сложить число 10 и 5, затем умножить на 4, и затем сравнить его с числом 61, результат вывести в алерт окно

// Extra tasks

// Задание 1
// Сложите числа 10 и 5, и преобразуйте результат в тип данных string

// Задание 2
// Создайте окно с полем ввода, ввведите туда число и результат преобразуйте в тип данных number

// Задание 3
// Создайте окно с полем ввода, ввведите туда число либо 1 либо 0 и результат преобразуйте в тип данных number, затем в тип данных boolean
